<a href="https://colab.research.google.com/github/Nandini1230/module3/blob/main/Q3_VerticalApproach.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np
from apyori import apriori

In [ ]:
dataset=pd.read_csv('bm.csv',header=None)
dataset.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12
0,age,job,marital,education,default,housing,loan,contact,month,day_of_week,duration,campaign,pdays
1,56,housemaid,married,basic.4y,no,no,no,telephone,may,mon,261,1,999
2,57,services,married,high.school,unknown,no,no,telephone,may,mon,149,1,999
3,37,services,married,high.school,no,yes,no,telephone,may,mon,226,1,999
4,40,admin.,married,basic.6y,no,no,no,telephone,may,mon,151,1,999

In [ ]:
dataset.shape

(41189, 13)

In [ ]:
transactions=[]
for i in range(0,7501):
    transactions.append([str(dataset.values[i,j]) for j in range(0,12)])

In [ ]:
transactions[:2]

[['age',
  'job',
  'marital',
  'education',
  'default',
  'housing',
  'loan',
  'contact',
  'month',
  'day_of_week',
  'duration',
  'campaign'],
 ['56',
  'housemaid',
  'married',
  'basic.4y',
  'no',
  'no',
  'no',
  'telephone',
  'may',
  'mon',
  '261',
  '1']]

In [ ]:
from apyori import apriori
rules=apriori(transactions,min_support=0.003,min_confidence=0.2,min_lift=3,min_length=2,max_length=2)

In [ ]:
results=list(rules)
results

[RelationRecord(items=frozenset({'59', 'retired'}), support=0.004399413411545127, ordered_statistics=[OrderedStatistic(items_base=frozenset({'59'}), items_add=frozenset({'retired'}), confidence=0.2894736842105263, lift=10.242179741807348)]),
 RelationRecord(items=frozenset({'housemaid', 'basic.4y'}), support=0.011998400213304892, ordered_statistics=[OrderedStatistic(items_base=frozenset({'housemaid'}), items_add=frozenset({'basic.4y'}), confidence=0.40909090909090906, lift=3.176595143986448)]),
 RelationRecord(items=frozenset({'professional.course', 'technician'}), support=0.06785761898413545, ordered_statistics=[OrderedStatistic(items_base=frozenset({'professional.course'}), items_add=frozenset({'technician'}), confidence=0.5974178403755869, lift=4.401995305164319), OrderedStatistic(items_base=frozenset({'technician'}), items_add=frozenset({'professional.course'}), confidence=0.5, lift=4.401995305164319)]),
 RelationRecord(items=frozenset({'student', 'single'}), support=0.008132249033462205, ordered_statistics=[OrderedStatistic(items_base=frozenset({'student'}), items_add=frozenset({'single'}), confidence=0.9242424242424242, lift=4.284760459976776)])]

In [ ]:
lhs,rhs,support=[],[],[]
for result in results:
    lhs.append(tuple(result[2][0][0])[0])
    rhs.append(tuple(result[2][0][1])[0])
    support.append(result[1])

In [ ]:
columns=list(zip(lhs,rhs,support))

In [ ]:
result_df=pd.DataFrame(columns)
result_df.columns=['Item1','Item2','Support']
result_df

                 Item1       Item2   Support
0                   59     retired  0.004399
1            housemaid    basic.4y  0.011998
2  professional.course  technician  0.067858
3              student      single  0.008132

In [ ]:
result_df=result_df.sort_values('Support',ascending=False)
result_df

                 Item1       Item2   Support
2  professional.course  technician  0.067858
1            housemaid    basic.4y  0.011998
3              student      single  0.008132
0                   59     retired  0.004399